const majorCategories = [
  {
    label: "가톨릭대학교",
    departments: [
      {
        label: "인문",
        majors: [
          "국어국문학과",
          "철학과",
          "국사학과",
          "영어영문학부",
          "중국언어문화학과",
          "일어일본문화학과",
          "프랑스어문화학과",
          "음악과",
          "성악과",
          "종교학과",
          "신학대학",
        ],
      },
      {
        label: "사회",
        majors: [
          "사회복지학과",
          "심리학과",
          "사회학과",
          "특수교육과",
          "경영학과",
          "회계학과",
          "국제학부",
          "법학과",
          "경제학과",
          "행정학과",
          "글로벌미래경영학과",
          "세무회계금융학과",
          "IT파이낸스학과",
        ],
      },
      {
        label: "자연",
        majors: [
          "화학과",
          "수학과",
          "물리학과",
          "공간디자인소비자학과",
          "의류학과",
          "아동학과",
          "식품영양학과",
          "의생명과학과",
          "약학대학",
          "간호대학",
          "의과대학",
        ],
      },
      {
        label: "공학",
        majors: [
          "컴퓨터정보공학부",
          "미디어기술콘텐츠학과",
          "정보통신전자공학부",
          "생명공학과",
          "에너지환경공학과",
          "바이오메디컬화학공학과",
          "인공지능학과",
          "데이터사이언스학과",
          "바이오메디컬소프트웨어학과",
        ],
      },
      {
        label: "자유전공",
        majors: ["자유전공학과"],
      },
    ],
  },
  {
    label: "유한대학교",
    departments: [
      {
        label: "공학부",
        majors: [
          "기계시스템전공",
          "소방설비안전전공",
          "전기공학전공",
          "전자공학전공",
          "컴퓨터소프트웨어전공",
          "게임콘텐츠전공",
          "인공지능전공",
          "컴퓨터정보통신전공",
          "IT비즈니스전공",
          "기계설계전공",
          "3D프린팅금형전공",
          "자동화공학과"
        ]
      },
      {
        label: "디자인문화학부",
        majors: [
          "산업디자인전공",
          "시각디자인전공",
          "패션디자인전공",
          "실내건축전공",
          "광고미디어전공",
          "방송영상전공",
          "애니메이션웹툰전공",
          "방송문예창작전공",
          "방송연예전공"
        ]
      },
      {
        label: "건강보건학부",
        majors: [
          "식품영양학과",
          "보건의료행정학과",
          "작업치료과",
          "반려동물보건학과",
          "응급구조과"
        ]
      },
      {
        label: "건강생활학부",
        majors: [
          "유한바이오제약전공",
          "유한생명화공전공",
          "피부메이크업전공",
          "뷰티화장품전공",
          "사회복지전공"
        ]
      },
      {
        label: "비즈니스학부",
        majors: [
          "호텔관광전공",
          "일본비즈니스전공",
          "경영정보전공",
          "세무회계전공",
          "항공서비스학과",
          "항공경영전공",
          "유통물류전공",
          "중국비즈니스전공"
        ],
      },
      // 다른 학과 추가
    ],
  },
  // 다른 학교 추가
];

export default majorCategories;
